<?php include './header.php' ?>
<?php // include './admin/stat.php' ?>
<script src='./js/addSummary.js'></script>
<link rel="stylesheet" type="text/css" href='/index.css'>

    <div id="slider">
        <div id="slidewrapper">
            <img src="/image/slider/page1.png" alt="Приветствую вас на своём ресурсе" class="slide">
            <img src="/image/slider/page2.png" alt="Здесь вы можете познакомится с моими творческими начинаниями" class="slide">
            <img src="/image/slider/page3.png" alt="И ознакомится с дебрями моего погружения в основы WEB-программирования" class="slide">
        </div>
        <div id="navBth">
            <input type="radio" name="navigation" class="navigation" id="1">
            <input type="radio" name="navigation" class="navigation" id="2">
            <input type="radio" name="navigation" class="navigation" id="3"> 
        </div>
    </div>
    <div id="advantages" class="menu" >
        <a href="#interested"> <div class='advantagesImg'><img src="image/advantages/interest.png" alt="Интерес"></div>      <div class="advantagesText">Заинтересованность</div></a>
        <a href="#perfectionism"> <div class='advantagesImg'><img src="image/advantages/perfectionism.png" alt="Красота"></div> <div class="advantagesText">Перфекционизм</div></a>
        <a href="#ambitiousness"> <div class='advantagesImg'><img src="image/advantages/ambitiousness.png" alt="Сила"></div>    <div class="advantagesText">Амбициозность</div></a>
        <a href="#activity"> <div class='advantagesImg'><img src="image/advantages/activity.png" alt="Поиск"> </div>       <div class="advantagesText">Активность</div></a>
    </div>
    <div id="boxAdvantages">
        <div  id="interested" class="lightBox">
                <h1> Заинтере&shyсованность в работе!</h1>
                <p>На мой взгляд, моим большим преимуществом является заинтересованность в деле. Моя молодость позволяет мне энергично интересоваться делом, за которое я взялась, я еще не устала от жизни и стремлюсь получить от неё максимум. Мне интересно решать новые задачи, находить к ним решение, познавать что-то новое, неизведанное, то, что так манит. Я готова с огромным желанием развиваться как профессионал и как личность, а это значит только одно, что вместе с моим личным развитием будет и развиваться организация. Да, не спорю, до определённого уровня необходимо дорасти, чтобы стать полезной для вашей компании. Но я уверенна, с моей заинтересованность это произойдёт достаточно быстро!
                </p>
        </div>
        <div id="perfectionism" class="lightBox">
                <h1>Перфекционизм!</h1>
                <p>Обладаю неутолимым желанием сделать всё хорошо, и даже идеально. Очень коробят недочёты в работе и в рациональности использования свободного пространства. На мой взгляд, всё разрабатываемое должно работать для людей, а не против них. Программное обеспечение обязано облегчить жизнь пользователя, а не заставить его почувствовать себя глупо. Очень огорчает видеть подобные реализации. И как разработчик, я стремлюсь к адаптивным, логичным интерфейсам. Это касается не только внешней составляющей, хочется творить и в результате получать правильные и красивые решения. 
                </p>
        </div>
        <div id="ambitiousness" class="lightBox">
                <h1>Амбициозность</h1>
                <p>Данное качество я тоже отнесу к моим преимуществам. Ведь, как прекрасно иметь в команде целеустремленных, амбициозных людей. Людей, которые не остановятся на достигнутом и будут стремиться к усовершенствованию, как своих профессиональных навыков, так и социального положения. А ведь именно сотрудники компании выполняют конечную работу: предоставляют продукт, общаются с конечным пользователем и представляют вашу организацию на рынке и т.п. И кода коллектив стремится к личностному росту, это в первую очередь отражается на компании!
                </p>
        </div>
        <div id="activity" class="lightBox">
                <h1>Активность!</h1>
                <p>Стремление к жизни, жизнь в действии и жизнь в начинаниях. Это ведь и является смыслом нашего бытия. Я с удовольствием и с энтузиазмом берусь за незнакомые для меня задачи. То потрясающее чувство, когда одолевают мысли о возможных решениях, когда погружаешься всецело в общение с собой, со всевозможной литературой и компетентными людьми, в поисках решения и это стремление не угасает даже ночью. Когда в порыве творческого начала просыпаешься с чувством, что понятно как оно работает и пока мысль не покинула воспалённое сознание необходимо срочно попробовать, и после стольких мучений получен необходимый результат и переполняют чувства радости гордости и ощущение успеха. И эти чувства, это именно то, ради чего стоит работать!
                </p>
        </div>
    </div>
    <div id="latter">
        <h1> Здравствуйте! </h1>
    
        <p>
            <a href="#imgFace"><img src="/image/face.jpg" alt="Личная фотография"  
                id="face" align="right" vspac="20" hspace="20"></a>
           Возможно, вас заинтересует моя кандидатура в качестве сотрудника вашей компании. Во время обучения в университете, я принимала участие в разработке модуля "Мониторинг деятельности подразделений ВУЗа". Занималась написанием технической документации и общением с конечным пользователем продукта, по вопросам улучшения интерфейса программного обеспечения. Успешно провела переговоры во время утверждения документации и сдачи в эксплуатацию разработанного программного продукта.
       </p>
       <p>
           Я бы хотела предложить вам стать частью коллектива вашей компании для возможности проявить весь свой потенциал и применить уже полученные знания, развить свои навыки и профессионализм. Приняв меня на работу, вы получите ценного сотрудника готового проявлять свои способности для развития вашей компании. Я являюсь человеком многогранным и с лёгкостью могу переключаться на разные задачи, даже самые неординарные.
        </p>
        <p>
            Предлагаю вам, ознакомится с моим подробным резюме. Строго прошу не судить, я еще не волшебник, а только учусь. Но с уверенностью заявляю, волшебником обязательно стану..
        </p>
        
    </div>
    <div class="menu" id="mainMenu">
        <a href="#info" title="Сокращенная автобиография">Личные данные</a>
        <a href="#education" title="Подробная информация об оразовании">Образование</a>
        <a href="#work" title="Подробная информация об опате работы">Опыт</a>
        <a href="#achievements" title="Подробная информация об увлечениях и хобби">Личные достижения</a>
        <a href="#communication" title="Как со мной связаться">Обратная связь</a>
    </div>
    <div id="info" class="anchor">
        <p> 
           Родилась 4 марта 1995 года, в городе Комсомольске-на-Амуре, Хабаровского края. Имею российское гражданство и являюсь русской. Не замужем, детей нет. В настоящее время проживаю в городе Комсомольске-на-Амуре Хабаровского края, готова к переездам по России. Буду рада общению с вами с удовольствием рассмотрю все предложения.
        </p>
    </div>
    <div id="education" class="anchor">
        <h1> Образование</h1>
        <ul id="listEducation">
            <li><h3>2016 – по настоящее время</h3>
                Комсомольский-на-Амуре государственный технический университет.
                <br>Специальность: <em>«Информатика и вычислительная техника»</em>.
            </li>
            <li><h3>2012 – 2016г.</h3> Комсомольский-на-Амуре государственный технический университет. 
                <br> Специальность: <em>«Программная инженерия»</em>.
            </li>
            <li> <h3>2013г.</h3> Курсы по повышению квалификации в «КнАГТУ».
                <br><em>«Администрирование локальных сетей»</em>.
            </li>
            <li> 
                <h3>2001 – 2012г.</h3> МОУ СОШ №37.
            </li>
        </ul>
        <div class="imgBox anchor" id="imgBoxForEducation" >
            <a href="#magistracy"><img src="/image/education/magistracy.jpg" alt="Зачётная книжка магистратура"></a>
            <a href="#bachelorPage1"><img src="/image/education/bachelorPage1.jpg" alt="Диплом бакалавра лист 1"></a>
            <a href="#bachelorPage2"><img src="/image/education/bachelorPage2.jpg" alt="Диплом бакалавра лист 2"></a>
            <a href="#bachelorPage3"><img src="/image/education/bachelorPage3.jpg" alt="Диплом бакалавра лист 3"></a>
            <a href="#bachelorPage4"><img src="/image/education/bachelorPage4.jpg" alt="Диплом бакалавра лист 4"></a>
        </div>
        <div class="lightBoxForImgBox" >
            <div class="lightBox" id="magistracy"> 
                    <img src="/image/education/magistracy.jpg" alt="Зачётная книжка магистратура">
            </div>
            <div class="lightBox" id="bachelorPage1"> 
                    <img src="/image/education/bachelorPage1.jpg" alt="Диплом бакалавра лист 1">
            </div>
            <div class="lightBox" id="bachelorPage2"> 
                    <img src="/image/education/bachelorPage2.jpg" alt="Диплом бакалавра лист 2">
            </div>
             <div class="lightBox" id="bachelorPage3"> 
                     <img src="/image/education/bachelorPage3.jpg" alt="Диплом бакалавра лист 3">
            </div>
             <div class="lightBox" id="bachelorPage4"> 
                     <img src="/image/education/bachelorPage4.jpg" alt="Диплом бакалавра лист 4">
            </div>
        </div>
       <!-- <a href="#addEducation" class="button">Добавить образование</a>-->
        <div class="lightBox" id="addEducation">
                <label>
                    Сроки обучения
                    <input type="date" id="dateStartEducation" >
                    <input type="date" id="dateEndEducation">
                </label>
                <input type="text" id="nameEducationInstitution" placeholder="Учебное заведение" size="100">
                <input type="text" id="nameSpeciality" placeholder="Специальность" size="60">
                <input type="button" id="addEducation" value="Добавить">
        </div>
    </div>
    <div id="work" class="anchor">
        <h1>Навыки и опыт работы</h1>



        <ul id="listWork">
            <li><h2>2016 – по настоящее время</h2> Инженер удостоверяющего центра.
                ООО «Инженерно-технический центр».
                <h3>Обязанности:</h3>
                <ul>
                    <li>выпуск электронных цифровых подписей;</li>
                    <li>техническая поддержка клиентов по программе, предназначенной для сдачи отчётности «СБИС»;</li>
                    <li>техническая поддержка по настройке доступа к электронным торговым площадкам.</li>
                </ul>
                <h3>Результаты</h3>
                <ul>
                    <li>успешно пройдена аттестация по направлению «Выпуск комерческих ключей»; </li>
                    <li>улучшены навыки общения с потоком людей;</li>
                    <li>получены навыки настройки электронных торговых площадок.</li>
                </ul>
            </li>
            <li>
                <h2>2015 – 2016г.</h2> Инженер отдела проектирования и разработки информационных систем. Комсомольский-на-Амуре государственный технический университет.
                 <h3>Обязанности:</h3>
                <ul>
                    <li>работа с пользователями программного обеспечения;</li>
                    <li>актуализация информации в базах данных;</li>
                    <li>тестирование пользовательского интерфейса;</li>
                    <li>написание технической документации к разрабатываемому программному обеспечению.</li>
                </ul>
                  <h3>Результаты:</h3>
                <ul>
                    <li>улучшены навыки общения с конечным пользователем;</li>
                    <li>разработан пакет сопроводительных документов к разработанному продукту;</li>
                    <li>усовершенствован пользовательский интерфейс.</li>
                </ul>
            </li>
            <li>
                <h2>2013 – 2014г.</h2> Лаборант исследователь в рамках выполнения НИОКР Проектирование электронной системы университета и разработка информационного модуля <em>«Мониторинг деятельности подразделений ВУЗа»</em>. Комсомольский-на-Амуре государственный технический университет.
                 <h3>Обязанности:</h3>
                <ul>
                    <li>исследование автоматизируемой предметной области; </li>
                    <li>разработка процессной модели в нотации IDEF0;</li>
                    <li>реализация ручного тестирования ПО;</li>
                    <li>написание технической документации к разрабатываемому программному обеспечению;</li>
                    <li>массовое обучение пользователей и по необходимости личные консультации по работе с системой.</li>
                </ul>
                  <h3>Результаты:</h3>
                <ul>
                    <li>получены представления разработки программного обеспечения в команде;</li>
                    <li>разраотан пакет документов к разрабатываемому продукту;</li>
                    <li>произвела призентацию и сдачу программного продукта в эксплуатацию.</li>
                </ul>
            </li>
        </ul>
    </div>            
    <div id="achievements" class="anchor">     
        <h1>Личные достижения</h1>
        <ul>
            <li>Финалист программы <em>«УМНИК 2015»</em>;</li>
            <li>участница спортивного фестиваля студентов Азии <em>«Новое поколение 2015»</em>;</li>
            <li>активно занимаюсь изучением web-праграммирования и английского языка;</li>
            <li>ответственная, легко обучаемая, коммуникабельная, обладаю организаторскими способностями. Без вредных привычек.</li>
        </ul>
        <!--  <div class="imgBox" id="imgBoxForAchievements">
            <a href="#magistracy"><img src="/image/education/magistracy.jpg" alt="Зачётная книжка магистратура"></a>
        </div> -->
       <em> На этом моё повествование о профессиональной деятельности окончено.</em>
       
    </div>
    <div id="communication" class="anchor" >
        <h1>Обратная связь</h1>
        <p> Если вас заинтереовало моё предложение со мной можно связаться по телефону: <a href="tel:+79144064313">+79144064313</a>,
        <br>или оставить для меня сообщение.</p>
    </div>
        <form  action="./handler/mail.php" method="POST" id="feedback">
            <input type="text" name="nameUser" placeholder="Имя и наименование организации" required/>
            <textarea name="description" id="description" rows="7" placeholder="Ожидаю ваши предложения и вопросы" required maxlength="1000"></textarea>
            <input type="text" name="phone" id="phone" class="phone" placeholder="Контактный номер" required/>
            <input type="email" name="email" id="email" class="mail" placeholder="Контактный e-mail" required/>
            <input type="submit" name="send" value="Отправить" id="in"/>
        </form>
     </div>
 <h2>С уважением, Наталья Ивановна! </h2>

<?php include './footer.php'?>